# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\r\Documents\Data Sheets\apple\SCSI2SD\SCSI2SD.cydsn\SCSI2SD.cyprj
# Date: Sat, 19 Jan 2019 22:32:33 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {SD_Data_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {SCSI_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 51 101} [list [get_pins {ClockBlock/dclk_glb_2}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\r\Documents\Data Sheets\apple\SCSI2SD\SCSI2SD.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\r\Documents\Data Sheets\apple\SCSI2SD\SCSI2SD.cydsn\SCSI2SD.cyprj
# Date: Sat, 19 Jan 2019 22:31:41 GMT
